

# #2.Print my name
# print("Stefan Ivanov Lafchiev")

# #3.Check all the types
# print(type(1))
# print(type(1.5))
# print(type("1.5"))
# print(type(1.5>2))

# #4.
# x = 3
# y = 10
# result = x * y 
# # print(result)
# print(f"{x}+{y}={x+y}")

# #5. Да се изчисли лицето на триъгълник, като неговата височина е 13.66, а срещуположната страна 245.54 см.
# a = 245.54
# b = 13.66
# area = a * b / 2
# print(area)

# 6. Фирма, занимаваща се с маркетинг, иска да пази запис с данни на нейните служители. 
# Всеки запис трябва да има следната характе­ристика – първо име, фамилия, възраст, пол (‘м’ или ‘ж’) и уникален номер на служителя (27560000 до 27569999). 
# Декларирайте необходи­мите променливи, нужни за да се запази информацията за един служи­тел, като използвате подходящи типове данни и описателни имена.

# name = "Ivan"
# surname = "Ivanov "
# last_name = "Lafchiev"
# gender = "m"
# gender = "m" or "w"
# number_of_employ = 27560001
# 27560000 < number_of_employ < 27569999
# print(f"{number_of_employ}, {name} {surname} {last_name} - {gender}")

# #7. - Декларирайте две променливи, които да са цели числа. Задайте им стойности съответно 5 и 10. Разменете стойностите им и ги отпечатайте.
# a = 5
# b = 10
# temp1 = a
# temp2 = b
# print(f"b = {temp1}")
# print(f"a = {temp2}")

#8. Напишете програма, която за дадени дължина и височина на успоредник, пресмята и отпечатва на конзолата неговия периметър и лице
# (за периметъра на усдпоредник ни трябват и двете страни P = 2a+2b)

# a = 10
# h = 2
# area = a * h
# print(area)

#9.Задача 9. Да се пресметне питагоровата теорема a2 + b2 = c2  при зададени стойности на a, b и c.

a = 2
a*=a
print(a)

# Задача 10. Да се напише програма, която да пресмята лицето на кръг при зададен радиус r.

# Задача 11. Да се напише програма, която пресмята от inches в centimeters. Един inches е 2.54 centimeters.

# a = float(input())
# b = float(input())
# # c = float(input())
# print(f"c**2 = {a**2} + {b**2} = {a**2+b**2}")

# #9.



